In [1]:
import pandas as pd
import numpy as np

In [2]:
names_dict ={
    'Name':['Ken','Jeff','John','Mike','Andrew','Ann','Sylvia','Dorothy','Emily','Loyford'],
    'Age':[31,52,56,12,45,np.nan,78,85,46,135],
    'Phone':[52,79,80,75,43,125,74,44,85,45],
    'Uni':['One','Two','Three','One','Two','Three','One','Two','Three','One']
}

In [3]:
index = ["Row_one","Row_two","Row_three","Row_four","Row_five","Row_six","Row_seven","Row_eight","Row_nine","Row_ten"]

In [4]:
df = pd.DataFrame(names_dict,index=index)

In [5]:
df.head()

             Name   Age  Phone    Uni
Row_one       Ken  31.0     52    One
Row_two      Jeff  52.0     79    Two
Row_three    John  56.0     80  Three
Row_four     Mike  12.0     75    One
Row_five   Andrew  45.0     43    Two

In [6]:
df.loc[1]

KeyError: 1

In [10]:
df.loc["Row_one"]

Name      Ken
Age      31.0
Phone      52
Uni       One
Name: Row_one, dtype: object

In [11]:
type(df.loc["Row_one"])

pandas.core.series.Series

In [12]:
df.loc["Row_one"][0]

'Ken'

In [13]:
df.loc["Row_one":"Row_two"]

         Name   Age  Phone  Uni
Row_one   Ken  31.0     52  One
Row_two  Jeff  52.0     79  Two

In [14]:
type(df.loc["Row_one":"Row_two"])

pandas.core.frame.DataFrame

In [15]:
df.loc["Row_one":"Row_two", "Name":"Age"]

         Name   Age
Row_one   Ken  31.0
Row_two  Jeff  52.0

In [16]:
df.loc["Row_one":"Row_two", "Name":"Phone"]

         Name   Age  Phone
Row_one   Ken  31.0     52
Row_two  Jeff  52.0     79

In [17]:
df.loc["Row_one":"Row_two"] = ["Joe",34,45,"Two"]

In [18]:
df.head()

             Name   Age  Phone    Uni
Row_one       Joe  34.0     45    Two
Row_two       Joe  34.0     45    Two
Row_three    John  56.0     80  Three
Row_four     Mike  12.0     75    One
Row_five   Andrew  45.0     43    Two

In [20]:
df.loc["Row_one":"Row_two"] = [["Joe",34,45,"Two"],["Derrick",56,46,"Ten"]]

In [21]:
df.head()

              Name   Age  Phone    Uni
Row_one        Joe  34.0     45    Two
Row_two    Derrick  56.0     46    Ten
Row_three     John  56.0     80  Three
Row_four      Mike  12.0     75    One
Row_five    Andrew  45.0     43    Two

In [22]:
df.loc[df["Name"] == "Joe"]

        Name   Age  Phone  Uni
Row_one  Joe  34.0     45  Two

In [23]:
df.loc[df["Name"] == "Joe"] = ["Elijah",37,89,"five"]

In [24]:
df.head()

              Name   Age  Phone    Uni
Row_one     Elijah  37.0     89   five
Row_two    Derrick  56.0     46    Ten
Row_three     John  56.0     80  Three
Row_four      Mike  12.0     75    One
Row_five    Andrew  45.0     43    Two

In [25]:
df.loc[(df["Name"] == "Elijah") | ( df["Phone"] == 89)]

           Name   Age  Phone   Uni
Row_one  Elijah  37.0     89  five

In [26]:
df.loc[(df["Name"] == "Elijah") & ( df["Phone"] == 89)]

           Name   Age  Phone   Uni
Row_one  Elijah  37.0     89  five

In [27]:
df.iloc["Row_one"]

TypeError: Cannot index by location index with a non-integer key

In [51]:
df.index.get_loc("Row_one") # Get integer location, slice or boolean mask for requested label.

0

In [29]:
df.iloc[0]

Name     Elijah
Age        37.0
Phone        89
Uni        five
Name: Row_one, dtype: object

In [54]:
df.iloc[0:5]

              Name   Age  Phone    Uni
Row_one        Eli  34.0     45    Two
Row_two    Derrick  56.0     46    Ten
Row_three     John  56.0     80  Three
Row_four      Mike  12.0     75    One
Row_five    Andrew  45.0     43    Two

In [31]:
df.iloc[0:1]

           Name   Age  Phone   Uni
Row_one  Elijah  37.0     89  five

In [32]:
df.iloc[0:1] = ["Kevin",34,45,"Two"]

In [33]:
df.iloc[0:1]

          Name   Age  Phone  Uni
Row_one  Kevin  34.0     45  Two

In [34]:
df.iloc[0:1]

          Name   Age  Phone  Uni
Row_one  Kevin  34.0     45  Two

In [36]:
df.iloc[0:1,0:1]

          Name
Row_one  Kevin

In [37]:
df.iloc[0:1,0:1] = "Eli"

In [38]:
df.head()

              Name   Age  Phone    Uni
Row_one        Eli  34.0     45    Two
Row_two    Derrick  56.0     46    Ten
Row_three     John  56.0     80  Three
Row_four      Mike  12.0     75    One
Row_five    Andrew  45.0     43    Two

In [39]:
df.head()

              Name   Age  Phone    Uni
Row_one        Eli  34.0     45    Two
Row_two    Derrick  56.0     46    Ten
Row_three     John  56.0     80  Three
Row_four      Mike  12.0     75    One
Row_five    Andrew  45.0     43    Two

In [40]:
df[["Name","Age"]]

              Name    Age
Row_one        Eli   34.0
Row_two    Derrick   56.0
Row_three     John   56.0
Row_four      Mike   12.0
Row_five    Andrew   45.0
Row_six        Ann    NaN
Row_seven   Sylvia   78.0
Row_eight  Dorothy   85.0
Row_nine     Emily   46.0
Row_ten    Loyford  135.0

In [41]:
df.drop(df[["Name","Age"]],axis=1)

           Phone    Uni
Row_one       45    Two
Row_two       46    Ten
Row_three     80  Three
Row_four      75    One
Row_five      43    Two
Row_six      125  Three
Row_seven     74    One
Row_eight     44    Two
Row_nine      85  Three
Row_ten       45    One

In [42]:
df[["Name","Age"]]

              Name    Age
Row_one        Eli   34.0
Row_two    Derrick   56.0
Row_three     John   56.0
Row_four      Mike   12.0
Row_five    Andrew   45.0
Row_six        Ann    NaN
Row_seven   Sylvia   78.0
Row_eight  Dorothy   85.0
Row_nine     Emily   46.0
Row_ten    Loyford  135.0

In [43]:
df.index.get_loc("Row_one") # Get integer location, slice or boolean mask for requested label.

0

In [44]:
df.tail()

              Name    Age  Phone    Uni
Row_six        Ann    NaN    125  Three
Row_seven   Sylvia   78.0     74    One
Row_eight  Dorothy   85.0     44    Two
Row_nine     Emily   46.0     85  Three
Row_ten    Loyford  135.0     45    One

In [45]:
df.iloc[-4]

Name     Sylvia
Age        78.0
Phone        74
Uni         One
Name: Row_seven, dtype: object

In [56]:
df.tail()

              Name    Age  Phone    Uni
Row_six        Ann    NaN    125  Three
Row_seven   Sylvia   78.0     74    One
Row_eight  Dorothy   85.0     44    Two
Row_nine     Emily   46.0     85  Three
Row_ten    Loyford  135.0     45    One

In [46]:
df.iloc[-4:]

              Name    Age  Phone    Uni
Row_seven   Sylvia   78.0     74    One
Row_eight  Dorothy   85.0     44    Two
Row_nine     Emily   46.0     85  Three
Row_ten    Loyford  135.0     45    One

In [47]:
df.iloc[-4:-2]

              Name   Age  Phone  Uni
Row_seven   Sylvia  78.0     74  One
Row_eight  Dorothy  85.0     44  Two

In [57]:
df.iloc[-4:-2,0:3]

              Name   Age  Phone
Row_seven   Sylvia  78.0     74
Row_eight  Dorothy  85.0     44

In [48]:
df.head()

              Name   Age  Phone    Uni
Row_one        Eli  34.0     45    Two
Row_two    Derrick  56.0     46    Ten
Row_three     John  56.0     80  Three
Row_four      Mike  12.0     75    One
Row_five    Andrew  45.0     43    Two

In [49]:
df.iloc[0:, 0:2]

              Name    Age
Row_one        Eli   34.0
Row_two    Derrick   56.0
Row_three     John   56.0
Row_four      Mike   12.0
Row_five    Andrew   45.0
Row_six        Ann    NaN
Row_seven   Sylvia   78.0
Row_eight  Dorothy   85.0
Row_nine     Emily   46.0
Row_ten    Loyford  135.0

In [50]:
df.drop(df.iloc[0:, 0:2], axis = 1)

           Phone    Uni
Row_one       45    Two
Row_two       46    Ten
Row_three     80  Three
Row_four      75    One
Row_five      43    Two
Row_six      125  Three
Row_seven     74    One
Row_eight     44    Two
Row_nine      85  Three
Row_ten       45    One